{
  "backend/main.mo": "Motoko actor defining access‑controlled storage and CRUD types for cashflows, properties, loans, wealth inputs, and user profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing summaries of many frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, dark mode palette, and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/offline-bundle/bundle.config.json": "Config defining build output, zip name, port, and metadata for generating the offline bundle.",
  "frontend/offline-bundle/create-windows-offline-zip.mjs": "Creates a Windows offline ZIP bundle by validating the build folder and packaging build assets and helper scripts using archiver.",
  "frontend/offline-bundle/README.txt": "User‑facing overview and quick‑start guide for the Windows offline application bundle.",
  "frontend/offline-bundle/start-server-win.bat": "Batch script that checks for Node.js and npx, then launches a local static server for the offline app.",
  "frontend/offline-bundle/start-server-win.ps1": "PowerShell launcher that checks for Node.js or Python and starts a local server to host the offline app.",
  "frontend/offline-bundle/WINDOWS_RUN_INSTRUCTIONS.txt": "Detailed instructions for running the offline bundle using a local server on Windows.",
  "frontend/public/sw.js": "Service worker that caches core assets, cleans old caches, and provides offline support including SPA navigation fallback.",
  "frontend/src/App.tsx": "Main app entry configuring routes, React Query, theme provider, service worker registration, and global layout guards.",
  "frontend/src/components/auth/AuthGate.tsx": "Pass-through auth wrapper that simply renders its children.",
  "frontend/src/components/auth/LoginButton.tsx": "Placeholder login button component that currently renders nothing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting users to enter and save their name via React Query, shown only when no profile exists.",
  "frontend/src/components/layout/AppShell.tsx": "App layout providing header, navigation, footer, and routing outlet with responsive mobile menu.",
  "frontend/src/components/navigation/NavLinks.tsx": "Navigation component mapping predefined routes to link buttons and highlighting the active path.",
  "frontend/src/components/storage/IndexedDbGuard.tsx": "Checks IndexedDB availability and either renders children or shows an error screen with guidance if storage is unavailable.",
  "frontend/src/features/cashflow/api.ts": "Provides React Query hooks to list, summarize, add/update, and delete cashflow entries via the storage repo.",
  "frontend/src/features/cashflow/components/CashflowEntriesTable.tsx": "Renders a table of cashflow entries with edit and delete actions, including confirmation handling.",
  "frontend/src/features/cashflow/components/CashflowEntryFormCard.tsx": "Form card for creating or editing cashflow entries with validation and mutation handling.",
  "frontend/src/features/cashflow/components/CashflowSummaryCards.tsx": "Displays summary cards showing totals to collect, totals to give, and net balance.",
  "frontend/src/features/daily-pl/api.ts": "Exposes a React Query hook that generates the daily profit/loss report from storage.",
  "frontend/src/features/daily-pl/components/DailyPLTable.tsx": "Renders a table of day‑wise profit/loss summaries sorted by date.",
  "frontend/src/features/dashboard/api.ts": "Aggregates dashboard metrics including net worth, asset totals, and monthly loan cashflow.",
  "frontend/src/features/dashboard/components/MonthlyCashFlowKpiCard.tsx": "Displays a KPI card showing monthly cashflow from interest income.",
  "frontend/src/features/dashboard/components/QuickActions.tsx": "Provides quick navigation buttons to add new loans or properties.",
  "frontend/src/features/dashboard/components/WealthOverviewDonut.tsx": "Shows a donut chart of asset allocation across properties, lending, and wealth inputs.",
  "frontend/src/features/lending/api.ts": "React Query hooks for listing, creating/updating, and deleting loans with cache invalidation.",
  "frontend/src/features/lending/components/LendingInsights.tsx": "Displays lending analytics using bar and pie charts, computing monthly interest and principal vs interest totals.",
  "frontend/src/features/lending/components/LoanFormCard.tsx": "Form component to add or edit a loan with validation and mutation handling.",
  "frontend/src/features/lending/components/LoansTable.tsx": "Renders a table of loans with calculated interest totals and supports editing and deletion.",
  "frontend/src/features/mpl/api.ts": "React Query hooks for managing matches, entries, P&L summary, and match settlement with cache updates.",
  "frontend/src/features/mpl/components/CreateMatchDialog.tsx": "Dialog for creating a new match with validation and mutation submission.",
  "frontend/src/features/mpl/components/EntriesTable.tsx": "Table component displaying betting entries with loading and empty states.",
  "frontend/src/features/mpl/components/EntryFormCard.tsx": "Form component to add a betting entry for a match, handling validation, mutation, and form reset.",
  "frontend/src/features/mpl/components/MatchDetailView.tsx": "Displays detailed match info, entries, P/L summary, and settlement actions with conditionally rendered components.",
  "frontend/src/features/mpl/components/MatchesListCard.tsx": "Shows a list of matches with status badges, enabling selection or displaying an empty state.",
  "frontend/src/features/mpl/components/SettleMatchDialog.tsx": "Dialog for settling a match by selecting a winner and triggering a settle mutation.",
  "frontend/src/features/mpl/utils/pl.ts": "Utility functions to calculate team P/L for scenarios and compute opposite P/L for entries.",
  "frontend/src/features/networth/api.ts": "React Query hooks for listing, updating, and aggregating wealth inputs and net worth values.",
  "frontend/src/features/networth/components/NetWorthSummaryCards.tsx": "Renders styled summary cards showing net worth, property value, lending portfolio, and wealth inputs.",
  "frontend/src/features/networth/components/WealthInputsFormCard.tsx": "Form to view and update latest wealth inputs with validation and mutation handling.",
  "frontend/src/features/properties/api.ts": "React-query hooks for listing, creating/updating, and deleting properties using the storage repo with automatic cache invalidation.",
  "frontend/src/features/properties/components/PropertyCardGrid.tsx": "Displays properties in a card grid with edit/delete actions and a delete confirmation dialog.",
  "frontend/src/features/properties/components/PropertyFormCard.tsx": "Form card for adding or editing a property, handling validation, mutation, and form reset.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CashflowPage.tsx": "Cashflow management page showing summary cards, entry form, and table with edit support.",
  "frontend/src/pages/DailyProfitLossPage.tsx": "Daily profit/loss report page summarizing totals and displaying daily breakdown in a table.",
  "frontend/src/pages/ExecutiveDashboardPage.tsx": "Loads dashboard overview data and displays KPI cards, quick actions, and a wealth donut with loading and error states.",
  "frontend/src/pages/MatchProfitLossPage.tsx": "Manages match selection and displays match list or match details, with loading states and match creation support.",
  "frontend/src/pages/MoneyLendingPage.tsx": "Lists loans, provides a loan form for creating or editing, and shows lending insights with loading and empty states.",
  "frontend/src/pages/NetWorthPage.tsx": "Fetches net worth summary and displays summary cards and a form for wealth inputs with loading and error handling.",
  "frontend/src/pages/PropertyLedgerPage.tsx": "Manages property creation and editing and displays a grid of properties with loading and empty views.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs success or failure.",
  "frontend/src/queryInvalidation.ts": "Provides functions to invalidate related React Query caches for aggregates, loans, properties, cashflow, wealth inputs, and MPL data.",
  "frontend/src/queryKeys.ts": "Defines hierarchical React Query keys for loans, properties, wealth inputs, aggregates, dashboard, user profile, cashflow, daily P/L, and MPL.",
  "frontend/src/storage/aggregates.ts": "Computes totals for property value, lending portfolio, wealth inputs, and net worth using IndexedDB repositories.",
  "frontend/src/storage/cashflowRepo.ts": "CRUD for cashflow entries in IndexedDB and computes total credits, debits, and net balance.",
  "frontend/src/storage/dailyPl.ts": "Generates daily profit/loss reports by grouping cashflow entries by day and summarizing totals.",
  "frontend/src/storage/ids.ts": "Generates auto-incrementing bigint IDs using a counters store in IndexedDB.",
  "frontend/src/storage/indexedDb.ts": "Initializes and manages the IndexedDB database, object stores, and utility functions for CRUD operations.",
  "frontend/src/storage/loansRepo.ts": "Handles loan CRUD operations in IndexedDB with bigint deserialization and ID generation.",
  "frontend/src/storage/mplPlSummary.ts": "Calculates match P/L summaries for both teams based on betting entries and match outcome.",
  "frontend/src/storage/mplRepo.ts": "Manages match and entry records in IndexedDB, including listing, creating, updating settlement, and enforcing settled-match rules.",
  "frontend/src/storage/profile.ts": "Stores and retrieves a single local user profile entry from the IndexedDB 'profile' store.",
  "frontend/src/storage/propertiesRepo.ts": "Provides CRUD-style functions for properties in IndexedDB, handling bigint field deserialization and ID generation.",
  "frontend/src/storage/timestamps.ts": "Generates a bigint timestamp in microseconds from the current time.",
  "frontend/src/storage/wealthInputsRepo.ts": "Handles listing, creating, updating, and deleting wealth input records in IndexedDB with bigint-safe deserialization.",
  "frontend/src/utils/currency.ts": "Formats numeric values into INR currency strings using Indian locale rules.",
  "frontend/src/utils/storageErrors.ts": "Maps IndexedDB errors to user-friendly messages and logs detailed storage errors for debugging.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining colors, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "Defines project-wide state, requirements, architecture notes, known issues, and feature tracking metadata."
}