{
  "backend/main.mo": "Main Motoko actor handling user profiles, access control, and data types for cashflow, properties, loans, and wealth entries.",
  "backend/migration.mo": "Simple migration module copying lastId from old actor state to new.",
  "feature_evidence.json": "Feature evidence report listing implemented MPL module features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files covering styling, routing, components, and feature modules.",
  "frontend/index.css": "Base Tailwind CSS theme defining light and dark mode color variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the app’s router structure and layout, including the new /match-pl route.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate that shows login UI until Internet Identity authentication completes.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to save their display name via backend user profile APIs.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, navigation, mobile menu, routed content, and footer.",
  "frontend/src/components/navigation/NavLinks.tsx": "Renders navigation buttons with icons and highlights the active route.",
  "frontend/src/features/cashflow/api.ts": "Provides React Query hooks to list, summarize, create/update, and delete cashflow entries via the backend actor.",
  "frontend/src/features/cashflow/components/CashflowEntriesTable.tsx": "Displays cashflow entries in a table with edit/delete actions and deletion confirmation.",
  "frontend/src/features/cashflow/components/CashflowEntryFormCard.tsx": "Form card for adding or editing a cashflow entry with validation and submission via mutation.",
  "frontend/src/features/cashflow/components/CashflowSummaryCards.tsx": "Shows cards summarizing total to collect, total to give, and net balance with styled indicators.",
  "frontend/src/features/daily-pl/api.ts": "Fetches the generated daily profit/loss report from the backend actor using React Query.",
  "frontend/src/features/daily-pl/components/DailyPLTable.tsx": "Displays daily profit/loss summaries in a table sorted by date.",
  "frontend/src/features/dashboard/api.ts": "Loads dashboard metrics including net worth, property value, lending portfolio, wealth inputs, and computed monthly cash flow.",
  "frontend/src/features/dashboard/components/MonthlyCashFlowKpiCard.tsx": "Shows a KPI card displaying formatted monthly cash flow from interest income.",
  "frontend/src/features/dashboard/components/QuickActions.tsx": "Provides quick navigation buttons for adding new loans or properties.",
  "frontend/src/features/dashboard/components/WealthOverviewDonut.tsx": "Renders a donut chart summarizing property, lending, and wealth input values, with a fallback when no data exists.",
  "frontend/src/features/lending/api.ts": "Provides React Query hooks to list, add/update, and delete loans using the backend actor API.",
  "frontend/src/features/lending/components/LendingInsights.tsx": "Displays bar and pie chart insights for loan interest and principal vs interest totals, with a placeholder when no loans exist.",
  "frontend/src/features/lending/components/LoanFormCard.tsx": "Form card for creating or editing loans, handling validation, submission, and form resets via mutation hooks.",
  "frontend/src/features/lending/components/LoansTable.tsx": "Renders a loans table with computed totals, edit/delete actions, and a confirmation dialog for deletions.",
  "frontend/src/features/mpl/api.ts": "Provides React Query hooks for matches, entries, P/L summaries, and settlement operations with automatic cache invalidation.",
  "frontend/src/features/mpl/components/CreateMatchDialog.tsx": "Dialog for creating new matches with basic validation and submission through the match creation API.",
  "frontend/src/features/mpl/components/EntriesTable.tsx": "Displays a card with a table of betting entries, handling loading and empty states.",
  "frontend/src/features/mpl/components/EntryFormCard.tsx": "Provides a form to create a new betting entry with validation and mutation submission.",
  "frontend/src/features/mpl/components/MatchDetailView.tsx": "Shows match details, P/L summary, entries list, and settlement UI with back navigation.",
  "frontend/src/features/mpl/components/MatchesListCard.tsx": "Renders a list of matches with status badges and a button to select a match.",
  "frontend/src/features/mpl/components/SettleMatchDialog.tsx": "Dialog for selecting a winning team and settling a match via mutation.",
  "frontend/src/features/mpl/utils/pl.ts": "Implements P/L calculations for teams based on betting entries and entry types.",
  "frontend/src/features/networth/api.ts": "React Query hooks for listing, updating, and summarizing wealth inputs and net worth data.",
  "frontend/src/features/networth/components/NetWorthSummaryCards.tsx": "Displays four summary cards for net worth, property, lending, and wealth inputs.",
  "frontend/src/features/networth/components/WealthInputsFormCard.tsx": "Form component that loads, edits, validates, and submits wealth input fields using related API hooks.",
  "frontend/src/features/properties/api.ts": "React Query hooks for listing, creating/updating, and deleting properties via the backend actor.",
  "frontend/src/features/properties/components/PropertyCardGrid.tsx": "Displays a grid of property cards with edit and delete actions, including confirmation dialog and formatting helpers.",
  "frontend/src/features/properties/components/PropertyFormCard.tsx": "Form for adding or editing a property, handling field population, validation, submission, and reset.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity login, identity persistence, and auth client management.",
  "frontend/src/index.css": "Tailwind CSS base setup defining light/dark theme variables and global styles.",
  "frontend/src/main.tsx": "Application entry point configuring React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/CashflowPage.tsx": "Displays cashflow summary, entry form, and entries table with edit handling and loading states.",
  "frontend/src/pages/DailyProfitLossPage.tsx": "Generates and displays daily profit/loss totals with summary cards and a detailed table.",
  "frontend/src/pages/ExecutiveDashboardPage.tsx": "Shows dashboard overview with monthly cashflow KPIs, quick actions, and wealth distribution visuals.",
  "frontend/src/pages/MatchProfitLossPage.tsx": "Manages match list and detailed match profit/loss views with loading and selection handling.",
  "frontend/src/pages/MoneyLendingPage.tsx": "Manages loan creation/editing, displays loans table, and shows lending insights with loading fallback.",
  "frontend/src/pages/NetWorthPage.tsx": "Loads and displays net worth summary cards and wealth input form with error and loading states.",
  "frontend/src/pages/PropertyLedgerPage.tsx": "Handles property creation/editing and displays property grid or empty-state message.",
  "frontend/src/queryInvalidation.ts": "Defines helper functions to invalidate related React Query caches for various modules.",
  "frontend/src/queryKeys.ts": "Defines structured React Query keys for loans, properties, wealth inputs, dashboards, cashflow, daily PL, and MPL.",
  "frontend/src/utils/currency.ts": "Formats numbers into INR currency strings using Indian locale conventions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color system, animations, typography/container-queries plugins, and extended theme settings for a FinTech-style UI.",
  "project_state.json": "Defines the project's architecture, modules, and requirements for a React/Tailwind frontend with a Motoko backend, including lending, property, net-worth, cashflow, and M(P/L) betting tracker features."
}