{
  "backend/main.mo": "Actor defining IDs, access control, user profiles, and typed records for cashflow, properties, loans, and wealth inputs with ownership and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping Version 11 changes to files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing styling, routing, PWA behavior, storage, and component logic across the app.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the app root and main TypeScript entry module.",
  "frontend/offline-bundle/bundle.config.json": "Configuration for building the Windows offline ZIP including version, output name, and metadata.",
  "frontend/offline-bundle/create-windows-offline-zip.mjs": "Creates a versioned Windows offline ZIP bundle by validating build output and packaging it with archiver.",
  "frontend/offline-bundle/README.txt": "User guide for the Windows offline bundle describing Version 11 contents, usage, and features.",
  "frontend/offline-bundle/start-server-win.bat": "Batch script that checks for Node.js and starts a local server to run the offline app on Windows.",
  "frontend/offline-bundle/start-server-win.ps1": "PowerShell launcher that checks for Node.js or Python and starts a local server for the offline app.",
  "frontend/offline-bundle/WINDOWS_RUN_INSTRUCTIONS.txt": "Detailed setup and troubleshooting instructions for running the offline Windows bundle via local server.",
  "frontend/public/sw.js": "Service worker implementing cache versioning, network-first navigation, and cache-first asset fetching.",
  "frontend/src/App.tsx": "Main React app that sets up routing, query client, theming, service worker registration, and layout guards.",
  "frontend/src/components/auth/AuthGate.tsx": "Placeholder auth wrapper that simply renders its children.",
  "frontend/src/components/auth/LoginButton.tsx": "Stub login button component that currently renders nothing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting users to save a name profile using React Query and local storage utilities.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level UI layout with header, navigation, footer, mobile menu, and service worker update notice.",
  "frontend/src/components/navigation/NavLinks.tsx": "Renders navigation links with icons and highlights the active route using router state.",
  "frontend/src/components/pwa/ServiceWorkerUpdateNotice.tsx": "Shows a popup when a service worker update is available and offers a refresh button.",
  "frontend/src/components/storage/IndexedDbGuard.tsx": "Checks IndexedDB availability and either renders children or displays error guidance if unavailable.",
  "frontend/src/features/cashflow/api.ts": "Provides React Query hooks for listing, summarizing, creating, updating, and deleting cashflow entries.",
  "frontend/src/features/cashflow/components/CashflowEntriesTable.tsx": "Displays a table of cashflow entries with edit and delete actions and confirmation dialog.",
  "frontend/src/features/cashflow/components/CashflowEntryFormCard.tsx": "Form card for adding or editing a cashflow entry with validation and mutation handling.",
  "frontend/src/features/cashflow/components/CashflowSummaryCards.tsx": "Shows summary cards for total to collect, total to give, and net balance with styled metrics.",
  "frontend/src/features/daily-pl/api.ts": "React Query hook for generating the daily profit/loss report with error handling.",
  "frontend/src/features/daily-pl/components/DailyPLTable.tsx": "Renders a sortable daily P/L table showing collected, given, and net values per day.",
  "frontend/src/features/dashboard/api.ts": "Fetches dashboard aggregates including net worth, property value, lending data, and calculates monthly cash flow.",
  "frontend/src/features/dashboard/components/MonthlyCashFlowKpiCard.tsx": "Displays a KPI card showing formatted monthly cash flow from interest income.",
  "frontend/src/features/dashboard/components/QuickActions.tsx": "Renders buttons for quick navigation to lending and property creation pages.",
  "frontend/src/features/dashboard/components/WealthOverviewDonut.tsx": "Displays a donut chart of asset allocation or a placeholder when no data exists.",
  "frontend/src/features/lending/api.ts": "Provides React Query hooks for listing, creating/updating, and deleting loans with cache invalidation.",
  "frontend/src/features/lending/components/LendingInsights.tsx": "Generates charts showing monthly interest income and principal vs interest distribution for loans.",
  "frontend/src/features/lending/components/LoanFormCard.tsx": "Form card for adding or editing a loan with validation, submission, and reset behavior.",
  "frontend/src/features/lending/components/LoansTable.tsx": "Displays a table of loans with actions for editing, deleting, and viewing computed totals.",
  "frontend/src/features/mpl/api.ts": "React Query hooks for MPL matches, entries, P/L summary, and settlement with robust error handling and invalidation.",
  "frontend/src/features/mpl/components/CreateMatchDialog.tsx": "Dialog component for creating a match with form validation and mutation handling.",
  "frontend/src/features/mpl/components/EntriesTable.tsx": "Displays betting entries in a table with loading and empty states.",
  "frontend/src/features/mpl/components/EntryFormCard.tsx": "Form card for adding a new betting entry to a match with input validation and mutation.",
  "frontend/src/features/mpl/components/MatchDetailView.tsx": "Shows match details, P/L summary, entries list, and settlement actions.",
  "frontend/src/features/mpl/components/MatchesListCard.tsx": "Lists all matches with status indicators and selection handling.",
  "frontend/src/features/mpl/components/SettleMatchDialog.tsx": "Dialog for selecting a winning team and settling a match.",
  "frontend/src/features/mpl/utils/pl.ts": "Utility functions for calculating team P/L and opposite P/L for entries.",
  "frontend/src/features/networth/api.ts": "React Query hooks for listing, updating, and aggregating wealth input and net worth data.",
  "frontend/src/features/networth/components/NetWorthSummaryCards.tsx": "Renders a grid of summary cards showing net worth metrics with icons, gradients, and formatted INR values.",
  "frontend/src/features/networth/components/WealthInputsFormCard.tsx": "Form card for entering and updating wealth inputs, prefilled from latest data and saved via mutation with validation.",
  "frontend/src/features/properties/api.ts": "Provides React Query hooks to list, add/update, and delete properties with error handling and cache invalidation.",
  "frontend/src/features/properties/components/PropertyCardGrid.tsx": "Displays a grid of property cards with details, edit/delete actions, and a confirmation dialog for deletions.",
  "frontend/src/features/properties/components/PropertyFormCard.tsx": "Form card for creating or editing a property, including validation, date conversion, and mutation submission.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state, loading stored identities, and controlling AuthClient behavior.",
  "frontend/src/index.css": "Tailwind CSS base setup defining light/dark theme variables, global styles, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity provider.",
  "frontend/src/pages/CashflowPage.tsx": "Displays cashflow summary, entry form, and entries table with edit support.",
  "frontend/src/pages/DailyProfitLossPage.tsx": "Generates and displays daily profit/loss totals and a daily breakdown table.",
  "frontend/src/pages/ExecutiveDashboardPage.tsx": "Shows dashboard overview including monthly cashflow KPIs, quick actions, and wealth distribution.",
  "frontend/src/pages/MatchProfitLossPage.tsx": "Lists matches and shows match-level profit/loss details with create and view flows.",
  "frontend/src/pages/MoneyLendingPage.tsx": "Manages loans with a form, loans table, and lending insights visualization.",
  "frontend/src/pages/NetWorthPage.tsx": "Displays net worth summary and provides a form for managing wealth inputs.",
  "frontend/src/pages/PropertyLedgerPage.tsx": "Manages properties with a form and property grid, showing portfolio details.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates, and exposes update activation.",
  "frontend/src/pwa/useServiceWorkerUpdate.ts": "React hook that signals when a service worker update is available and applies it.",
  "frontend/src/queryInvalidation.ts": "Provides helper functions to invalidate react-query caches for various domains.",
  "frontend/src/queryKeys.ts": "Defines structured react-query keys for all data domains in the app.",
  "frontend/src/routes/paths.ts": "Centralized constants for app route paths.",
  "frontend/src/storage/aggregates.ts": "Computes aggregate values like property total, lending total, wealth inputs, and net worth.",
  "frontend/src/storage/cashflowRepo.ts": "CRUD operations for cashflow entries in IndexedDB and summary calculation.",
  "frontend/src/storage/dailyPl.ts": "Generates daily profit/loss summaries by grouping cashflow entries by day and computing totals.",
  "frontend/src/storage/ids.ts": "Implements auto-incrementing bigint IDs using an IndexedDB counters store.",
  "frontend/src/storage/indexedDb.ts": "Initializes and manages the app's IndexedDB schema and provides helpers for reading and writing object stores.",
  "frontend/src/storage/loansRepo.ts": "CRUD utilities for loans, including ID generation, timestamping, and bigint deserialization.",
  "frontend/src/storage/mplPlSummary.ts": "Computes strong/weak PL and final score for a match based on betting entries.",
  "frontend/src/storage/mplRepo.ts": "Manages matches and betting entries with creation, lookup, and settlement logic using IndexedDB.",
  "frontend/src/storage/profile.ts": "Stores and retrieves a simple user profile record from IndexedDB.",
  "frontend/src/storage/propertiesRepo.ts": "CRUD operations for properties with bigint fields and timestamp handling.",
  "frontend/src/storage/timestamps.ts": "Provides a microsecond-precision bigint timestamp generator.",
  "frontend/src/storage/wealthInputsRepo.ts": "CRUD functions for wealth input records using IndexedDB and autogenerated IDs.",
  "frontend/src/utils/currency.ts": "Formats numbers into INR currency strings using Indian locale rules.",
  "frontend/src/utils/storageErrors.ts": "Maps storage-related errors to user-friendly messages and logs detailed error info.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and removing URL and session parameters for routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH-based color palette, animations, fonts, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature requirements, architectural notes, and known issues for the Windows-downloadable offline portal build."
}