{
  "backend/main.mo": "Defines types and access‑controlled storage for users, cashflow, properties, loans, and wealth inputs, with ID generation and profile CRUD.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files used for reference in build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme variables and global background/foreground styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main entry script.",
  "frontend/public/sw.js": "Service worker implementing offline caching, install/activate lifecycle, and navigation fallback.",
  "frontend/src/App.tsx": "Main React app wiring routes, theme provider, AuthGate, profile dialog, AppShell, and service worker registration.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that simply renders children without authentication checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated login button component returning null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Local‑profile setup dialog prompting for a display name and saving it via React Query.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, navigation, mobile menu, content outlet, and footer.",
  "frontend/src/components/navigation/NavLinks.tsx": "Renders navigation buttons with active state detection and optional navigation callback.",
  "frontend/src/features/cashflow/api.ts": "Provides React Query hooks for listing, summarizing, adding/updating, and deleting cashflow entries.",
  "frontend/src/features/cashflow/components/CashflowEntriesTable.tsx": "Displays a table of cashflow entries with edit/delete controls and empty-state handling.",
  "frontend/src/features/cashflow/components/CashflowEntryFormCard.tsx": "Form card for adding or editing cashflow entries with validation and mutation handling.",
  "frontend/src/features/cashflow/components/CashflowSummaryCards.tsx": "Shows summary cards for total to collect, total to give, and net cashflow balance.",
  "frontend/src/features/daily-pl/api.ts": "Provides a hook to generate and fetch the daily profit/loss report.",
  "frontend/src/features/daily-pl/components/DailyPLTable.tsx": "Renders a sortable daily P/L table with formatted dates and amounts.",
  "frontend/src/features/dashboard/api.ts": "Fetches dashboard overview data including net worth, portfolio totals, and monthly cashflow.",
  "frontend/src/features/dashboard/components/MonthlyCashFlowKpiCard.tsx": "Card showing formatted monthly cashflow from interest income.",
  "frontend/src/features/dashboard/components/QuickActions.tsx": "Provides buttons for quickly navigating to add loan or property screens.",
  "frontend/src/features/dashboard/components/WealthOverviewDonut.tsx": "Renders a donut chart summarizing asset allocation from property, lending, and wealth inputs, with a fallback when no data exists.",
  "frontend/src/features/lending/api.ts": "Provides React Query hooks for listing, creating/updating, and deleting loans with automatic cache invalidation.",
  "frontend/src/features/lending/components/LendingInsights.tsx": "Displays lending analytics including monthly interest bar charts and principal vs interest pie charts, with an empty state when no loans exist.",
  "frontend/src/features/lending/components/LoanFormCard.tsx": "Form component for adding or editing a loan, handling validation, submission, and field population on edit.",
  "frontend/src/features/lending/components/LoansTable.tsx": "Shows a table of loans with computed totals and actions for editing or deleting entries, including confirmation dialogs.",
  "frontend/src/features/mpl/api.ts": "Defines React Query hooks for managing MPL matches, entries, P/L summaries, and settlement with related cache updates.",
  "frontend/src/features/mpl/components/CreateMatchDialog.tsx": "Dialog form for creating a new match with validation and mutation handling.",
  "frontend/src/features/mpl/components/EntriesTable.tsx": "Renders a table of betting entries with loading/empty states and formatted fields like date, rate, and amount.",
  "frontend/src/features/mpl/components/EntryFormCard.tsx": "Provides a form to create a betting entry with validation and submission to the add-entry API.",
  "frontend/src/features/mpl/components/MatchDetailView.tsx": "Displays detailed match info, entries, P/L summary, and settlement UI with status-specific sections.",
  "frontend/src/features/mpl/components/MatchesListCard.tsx": "Shows a list of user matches with status badges and selection handling; includes empty state messaging.",
  "frontend/src/features/mpl/components/SettleMatchDialog.tsx": "Modal dialog allowing users to select a winning team and settle a match through an API call.",
  "frontend/src/features/mpl/utils/pl.ts": "Contains functions to calculate team-specific and opposite P/L values based on betting entries and types.",
  "frontend/src/features/networth/api.ts": "React Query hooks to list, update, and aggregate wealth inputs including net worth and related totals.",
  "frontend/src/features/networth/components/NetWorthSummaryCards.tsx": "Renders summary cards for net worth metrics with icons, gradients, and formatted values.",
  "frontend/src/features/networth/components/WealthInputsFormCard.tsx": "Form card for entering and updating wealth inputs, prefilled from latest saved data and submitted via mutation.",
  "frontend/src/features/properties/api.ts": "React Query hooks for listing, adding/updating, and deleting properties with cache invalidation.",
  "frontend/src/features/properties/components/PropertyCardGrid.tsx": "Displays properties in a card grid with edit/delete actions and confirmation dialog for deletions.",
  "frontend/src/features/properties/components/PropertyFormCard.tsx": "Form card for adding or editing a property, validating inputs and submitting via mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity auth state, login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind CSS setup with custom design tokens for light/dark themes and global utility styles.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/CashflowPage.tsx": "Cashflow page displaying summary, entry form, and entries table with edit support.",
  "frontend/src/pages/DailyProfitLossPage.tsx": "Displays daily cashflow profit/loss totals and a table by fetching a generated daily report.",
  "frontend/src/pages/ExecutiveDashboardPage.tsx": "Loads and presents high-level financial dashboards including monthly cashflow, quick actions, and wealth distribution.",
  "frontend/src/pages/MatchProfitLossPage.tsx": "Lists matches and shows detailed betting P/L for a selected match with create/edit support.",
  "frontend/src/pages/MoneyLendingPage.tsx": "Manages loan creation and editing, and displays loan tables and lending insights.",
  "frontend/src/pages/NetWorthPage.tsx": "Fetches and displays net worth summary cards and a form for updating wealth inputs.",
  "frontend/src/pages/PropertyLedgerPage.tsx": "Manages property records with a form and grid view, supporting create and edit workflows.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/src/queryInvalidation.ts": "Provides helper functions to invalidate specific React Query caches for app data groups.",
  "frontend/src/queryKeys.ts": "Defines centralized React Query keys for all major data entities and subqueries.",
  "frontend/src/storage/aggregates.ts": "Computes aggregate totals for properties, loans, wealth inputs, and overall net worth from storage.",
  "frontend/src/storage/cashflowRepo.ts": "Handles CRUD operations for cashflow entries and computes total credit/debit summaries.",
  "frontend/src/storage/dailyPl.ts": "Generates daily profit/loss summaries by grouping cashflow entries by day.",
  "frontend/src/storage/ids.ts": "Generates incremental bigint IDs using an IndexedDB-backed counter store.",
  "frontend/src/storage/indexedDb.ts": "Initializes IndexedDB stores and provides generic helpers for CRUD and index-based queries.",
  "frontend/src/storage/loansRepo.ts": "CRUD helpers for loans stored in IndexedDB, including ID generation and timestamps.",
  "frontend/src/storage/mplPlSummary.ts": "Computes per-team P/L and final score for a match based on betting entries.",
  "frontend/src/storage/mplRepo.ts": "Manages matches and betting entries in IndexedDB, including creation, listing, and settlement.",
  "frontend/src/storage/profile.ts": "Loads and saves a simple local user profile in the IndexedDB 'profile' store.",
  "frontend/src/storage/propertiesRepo.ts": "CRUD utilities for property records with autogenerated IDs and timestamps.",
  "frontend/src/storage/timestamps.ts": "Provides a nanosecond-style timestamp based on Date.now().",
  "frontend/src/storage/wealthInputsRepo.ts": "CRUD functions for wealth input records stored in IndexedDB.",
  "frontend/src/utils/currency.ts": "Formats numbers as INR currency using the Indian locale.",
  "frontend/src/utils/urlParams.ts": "Extracts, stores, retrieves, and clears URL and session parameters for routing/state persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, fonts, animations, and plugin setup.",
  "project_state.json": "Describes the project’s offline-focused architecture, modules, features, and known issues."
}