{
  "kind": "build_request",
  "title": "Version 11 final rebuild + deploy with service-worker cache busting so users receive the latest dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-56",
      "text": "Produce Version 11 as a clean rebuild and redeploy of the current application state, ensuring all previously requested changes are included in the deployed artifacts (frontend build output and offline Windows bundle).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Process all the changes I’ve requested and again rebuild and deploy for the final time I want version 11 the final version"
        ]
      },
      "acceptanceCriteria": [
        "A clean production build completes successfully without manual intervention.",
        "The deployed app loads all existing modules (Dashboard, Lending, Properties, Net Worth, Cashflow, Daily P/L, M(P/L)) without runtime errors.",
        "The Windows offline ZIP bundle is regenerated from the same Version 11 build output and can be started via the provided Windows scripts."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Fix the stale-UI issue by implementing Version 11 cache-busting for the service worker so that after deployment, clients do not stay stuck on older cached dashboard assets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the dashboard is still the same what did you change",
          "Process all the changes I’ve requested and again rebuild and deploy for the final time I want version 11 the final version"
        ]
      },
      "acceptanceCriteria": [
        "The service worker cache name/version is updated so a Version 11 deploy causes old caches to be replaced/invalidated.",
        "After deployment, a user who revisits the app receives the new JS/CSS bundle rather than continuing to render the previous dashboard UI indefinitely.",
        "SPA navigation fallback still works offline (navigating directly to routes like /properties, /daily-profit-loss, /match-pl works when offline after first load)."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Add a user-facing in-app update notice when a new service worker is available so users can refresh to load the latest Version 11 UI, using English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the dashboard is still the same what did you change"
        ]
      },
      "acceptanceCriteria": [
        "When a new service worker is installed and waiting, the app shows a clear update message in English (e.g., \"A new version is available. Refresh to update.\").",
        "The user can trigger the update flow (refresh/reload) without needing to open browser devtools or manually clear site data.",
        "If no update is available, no update message is shown."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Update the offline Windows bundle metadata to reflect Version 11 so the generated ZIP and included metadata clearly identify the final release version.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want version 11 the final version"
        ]
      },
      "acceptanceCriteria": [
        "The offline-bundle configuration metadata includes Version 11 (or equivalent explicit version string).",
        "The generated ZIP name and/or included instructions clearly indicate the build corresponds to Version 11.",
        "Bundle creation script completes successfully and outputs a valid ZIP containing the /app build and Windows launch scripts."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Backend must remain single-actor architecture with all Motoko logic in backend/main.mo; only add backend/migration.mo if an upgrade requires state migration.",
    "All user-facing text added/changed by this work must be in English."
  ],
  "nonGoals": [
    "Do not introduce new product features beyond ensuring Version 11 rebuild/deploy correctness and cache/update behavior.",
    "Do not add third-party authentication providers or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}