{
  "kind": "build_request",
  "title": "Fix offline storage so create/save works for Loans, Properties, and M(P/L) Matches",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Fix the local persistence layer so that creating/saving records works reliably across the app (at minimum: saving a new loan, saving a new property, and creating a new match) without throwing errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "No the code isnt working whenever I’m trying to save a new loan or save a new property or trying to create a new match its showing error in everything",
          "Failed to save loan",
          "Start the build"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load, adding a Loan succeeds and shows the existing success toast (not the failure toast), and the new loan appears in the Loans table without requiring a refresh.",
        "Adding a Property succeeds and the new property appears in the Property grid/list without requiring a refresh.",
        "Creating a new M(P/L) Match succeeds and the new match appears in the match list without requiring a refresh.",
        "No unhandled promise rejections appear in the browser console during these create actions."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Make IndexedDB storage compatible and consistent by eliminating BigInt storage/key mismatches in IndexedDB reads/writes (IDs, timestamps, and indexed fields like matchId), ensuring that data can be written and later read back correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "whenever I’m trying to save a new loan or save a new property or trying to create a new match its showing error in everything"
        ]
      },
      "acceptanceCriteria": [
        "All IndexedDB object stores used by Loans/Properties/M(P/L) can successfully persist records with their required fields, and subsequent list queries return the newly-created records.",
        "M(P/L) entries store and retrieve correctly by matchId index (creating a match, adding an entry, and listing entries returns the new entry for that match).",
        "Aggregations that compare timestamps (e.g., selecting the latest wealth inputs) work correctly with the persisted timestamp type."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Improve error reporting for failed saves: when a create/save mutation fails, surface a clearer user-facing error message that includes a short actionable hint when storage is unavailable (e.g., blocked storage context), while keeping existing success messages unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Failed to save loan",
          "when I’m trying to create a match its showing failed to create match"
        ]
      },
      "acceptanceCriteria": [
        "If a save fails, the toast/error message is still in English and includes a brief reason/hint (where available) instead of only a generic 'Failed to save …' message.",
        "The console log includes the underlying error object (or error message) for debugging, and the UI does not crash."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Add a runtime guard for unsupported execution contexts where IndexedDB is unavailable (or blocked), and show an in-app blocking notice explaining that the app must be run from a local server origin (http://localhost/...) rather than directly opening index.html via file://.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the code isnt working ... trying to save ... its showing error in everything"
        ]
      },
      "acceptanceCriteria": [
        "When the app is opened in a context where IndexedDB cannot be opened, the app shows a clear English message explaining the issue and how to fix it (run via the provided Windows local server scripts / localhost), instead of allowing silent failures on Save/Create.",
        "When opened in a normal localhost-served context, the guard does not appear and normal app usage is unaffected."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (compose them instead).",
    "Keep the app offline-first and continue using the existing React Query queryKeys + invalidation pattern.",
    "Respect the existing single-page app routing and offline bundle approach; no new backend services or external databases."
  ],
  "nonGoals": [
    "Do not change the UI feature set, screens, or navigation structure beyond what is necessary to fix storage/save failures.",
    "Do not re-introduce Internet Identity login requirements or backend canister dependency for CRUD.",
    "Do not redesign charts, calculations, or formatting (except where required due to the storage type fix)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}