{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix offline IndexedDB persistence for Loans, Properties, and M(P/L) Matches",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Stabilize the offline persistence layer so create/save for Loans, Properties, and Matches works reliably and updates UI lists via existing React Query invalidation (no refresh needed).",
      "acceptanceCriteria": [
        "On a fresh load, adding a Loan succeeds and shows the existing success toast (not the failure toast), and the new loan appears in the Loans table without requiring a refresh.",
        "Adding a Property succeeds and the new property appears in the Property grid/list without requiring a refresh.",
        "Creating a new M(P/L) Match succeeds and the new match appears in the match list without requiring a refresh.",
        "No unhandled promise rejections appear in the browser console during these create actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/indexedDb.ts",
          "operation": "modify",
          "description": "Fix IndexedDB CRUD helpers to use consistent key types (remove Number(...) coercions), improve transaction/request error propagation, and ensure create/write operations do not throw due to key/type mismatches."
        },
        {
          "path": "frontend/src/storage/loansRepo.ts",
          "operation": "modify",
          "description": "Update Loan persistence to write/read with a consistent IndexedDB-safe representation for IDs/timestamps and return correct runtime types so list + invalidation reflects new records immediately."
        },
        {
          "path": "frontend/src/storage/propertiesRepo.ts",
          "operation": "modify",
          "description": "Update Property persistence to write/read with a consistent IndexedDB-safe representation for IDs/timestamps and return correct runtime types so list + invalidation reflects new records immediately."
        },
        {
          "path": "frontend/src/storage/mplRepo.ts",
          "operation": "modify",
          "description": "Fix Match + Entry persistence and retrieval so match creation and listing entries for a match work reliably and invalidate the correct React Query caches without requiring refresh."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Make IndexedDB storage consistent by eliminating BigInt storage/key mismatches for IDs, timestamps, and indexed fields (e.g., entries.matchId), including safe read-back and timestamp comparisons.",
      "acceptanceCriteria": [
        "All IndexedDB object stores used by Loans/Properties/M(P/L) can successfully persist records with their required fields, and subsequent list queries return the newly-created records.",
        "M(P/L) entries store and retrieve correctly by matchId index (creating a match, adding an entry, and listing entries returns the new entry for that match).",
        "Aggregations that compare timestamps (e.g., selecting the latest wealth inputs) work correctly with the persisted timestamp type."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/indexedDb.ts",
          "operation": "modify",
          "description": "Bump the IndexedDB version and add a migration path to normalize persisted bigint-like fields (IDs/timestamps/index fields) into a single consistent storage type, ensuring future reads/queries use the same type."
        },
        {
          "path": "frontend/src/storage/mplRepo.ts",
          "operation": "modify",
          "description": "Ensure entries are written with an IndexedDB-index-compatible matchId type and listEntries queries by the same exact type, preventing index lookups from failing silently."
        },
        {
          "path": "frontend/src/storage/loansRepo.ts",
          "operation": "modify",
          "description": "Normalize loan id/createdAt/updatedAt persistence to the same storage type used across repos, and deserialize back to runtime bigints so comparisons and formatting remain correct."
        },
        {
          "path": "frontend/src/storage/propertiesRepo.ts",
          "operation": "modify",
          "description": "Normalize property id/acquisitionDate/createdAt/updatedAt persistence to the same storage type used across repos, and deserialize back to runtime bigints for correct date handling."
        },
        {
          "path": "frontend/src/storage/wealthInputsRepo.ts",
          "operation": "modify",
          "description": "Normalize wealth-input id/createdAt/updatedAt persistence and deserialization so timestamp comparisons (latest updatedAt) remain correct after reading from IndexedDB."
        },
        {
          "path": "frontend/src/storage/cashflowRepo.ts",
          "operation": "modify",
          "description": "Normalize cashflow entry id/createdAt/updatedAt persistence and deserialization so daily P/L grouping logic operates on correct bigint timestamps after reading from IndexedDB."
        },
        {
          "path": "frontend/src/storage/aggregates.ts",
          "operation": "modify",
          "description": "Ensure aggregate computations that compare timestamps rely on correctly-deserialized bigint timestamps from storage (no mixed string/bigint comparisons)."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Improve user-facing save error toasts with actionable hints when storage is unavailable, while preserving existing success toasts; ensure underlying errors are logged for debugging without crashing UI.",
      "acceptanceCriteria": [
        "If a save fails, the toast/error message is still in English and includes a brief reason/hint (where available) instead of only a generic 'Failed to save …' message.",
        "The console log includes the underlying error object (or error message) for debugging, and the UI does not crash."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/storageErrors.ts",
          "operation": "create",
          "description": "Add a small helper to convert storage/IndexedDB errors into clear English messages with actionable hints (e.g., blocked storage context), while allowing the caller to keep existing success messages unchanged."
        },
        {
          "path": "frontend/src/features/lending/components/LoanFormCard.tsx",
          "operation": "modify",
          "description": "Use the new storage error helper to show a clearer toast on save failure (keep the existing success toast text unchanged) and log the full underlying error object to the console."
        },
        {
          "path": "frontend/src/features/properties/components/PropertyFormCard.tsx",
          "operation": "modify",
          "description": "Use the new storage error helper to show a clearer toast on save failure (keep the existing success toast text unchanged) and log the full underlying error object to the console."
        },
        {
          "path": "frontend/src/features/mpl/components/CreateMatchDialog.tsx",
          "operation": "modify",
          "description": "Use the new storage error helper to show a clearer toast on create failure (keep the existing success toast text unchanged) and log the full underlying error object to the console."
        },
        {
          "path": "frontend/src/features/mpl/components/EntryFormCard.tsx",
          "operation": "modify",
          "description": "Improve failure toast(s) for adding an entry by using the same storage error helper and logging the underlying error, preventing generic failures when IndexedDB/index lookups fail."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Add a runtime guard that detects when IndexedDB cannot be opened (e.g., file:// or blocked context) and shows a blocking in-app notice instructing users to run via localhost/local server scripts.",
      "acceptanceCriteria": [
        "When the app is opened in a context where IndexedDB cannot be opened, the app shows a clear English message explaining the issue and how to fix it (run via the provided Windows local server scripts / localhost), instead of allowing silent failures on Save/Create.",
        "When opened in a normal localhost-served context, the guard does not appear and normal app usage is unaffected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/storage/IndexedDbGuard.tsx",
          "operation": "create",
          "description": "Create a blocking guard component that attempts to open IndexedDB at runtime; if it fails, render an in-app notice explaining that the app must be served from a local server origin (http://localhost/...) and not opened via file://."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the IndexedDbGuard into the root route composition so the notice blocks normal screens only when IndexedDB is unavailable, without adding new routes or changing navigation structure."
        },
        {
          "path": "frontend/src/storage/indexedDb.ts",
          "operation": "modify",
          "description": "Expose/strengthen IndexedDB open error signals (including blocked/unsupported contexts) so the runtime guard can reliably detect and display the blocking notice."
        },
        {
          "path": "frontend/offline-bundle/WINDOWS_RUN_INSTRUCTIONS.txt",
          "operation": "modify",
          "description": "Align the in-app guard message wording with the existing Windows local server instructions (English), reinforcing the required localhost serving approach."
        }
      ]
    }
  ]
}