{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Offline-capable wealth portal with IndexedDB storage and PWA caching",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Remove Internet Identity login gating so routes and pages load offline without blocking on authentication.",
      "acceptanceCriteria": [
        "Opening the app with no network connection does not show an Internet Identity login screen and does not block access to any module pages.",
        "No feature page throws an 'Actor not available' error during normal navigation when offline."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Convert AuthGate into a non-blocking wrapper that always renders children (no full-screen login/initializing screens) so the app loads directly into the existing AppShell/routes while offline."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure the header does not require authentication to render; keep existing navigation and layout intact while allowing the app to be used without logging in."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Replace backend-dependent user profile with a local-only profile persisted on device while keeping the existing ProfileSetupDialog flow.",
      "acceptanceCriteria": [
        "On first load with no local profile, the profile dialog appears and saving a name persists it locally.",
        "On subsequent loads, the profile dialog does not appear and the app remains usable offline."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/profile.ts",
          "operation": "create",
          "description": "Add local-only profile persistence (read/write display name) backed by the app’s IndexedDB/local database layer."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Refactor ProfileSetupDialog to use the local profile store (instead of useActor + backend calls) while preserving the existing prompt-once/save/do-not-prompt-again behavior and the existing queryKeys.userProfile.current() cache key."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Implement IndexedDB-based persistence for all module entities (loans, properties, wealth inputs, cashflow entries, M(P/L) matches, M(P/L) entries) including IDs and timestamps.",
      "acceptanceCriteria": [
        "Creating, editing, and deleting records in each module persists across page reloads without a network connection.",
        "IDs are unique per entity type and stable across reloads.",
        "Timestamps required by the UI are stored and updated on create/update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/indexedDb.ts",
          "operation": "create",
          "description": "Create an IndexedDB wrapper responsible for database open/upgrade, typed object stores for each entity type, and generic get/list/put/delete helpers."
        },
        {
          "path": "frontend/src/storage/ids.ts",
          "operation": "create",
          "description": "Implement local ID generation with per-entity counters (stored in IndexedDB) to produce unique, stable bigint IDs per entity type across reloads."
        },
        {
          "path": "frontend/src/storage/timestamps.ts",
          "operation": "create",
          "description": "Add helpers to generate/update bigint timestamps for createdAt/updatedAt fields in a consistent manner across all locally persisted entities."
        },
        {
          "path": "frontend/src/storage/loansRepo.ts",
          "operation": "create",
          "description": "Add a loans repository implementing local list/get/addOrUpdate/delete operations that preserve UI-required fields (id, createdAt, updatedAt, etc.)."
        },
        {
          "path": "frontend/src/storage/propertiesRepo.ts",
          "operation": "create",
          "description": "Add a properties repository implementing local list/get/addOrUpdate/delete operations with stable IDs and timestamps."
        },
        {
          "path": "frontend/src/storage/wealthInputsRepo.ts",
          "operation": "create",
          "description": "Add a wealth inputs repository implementing local list/get/addOrUpdate/delete operations with stable IDs and timestamps."
        },
        {
          "path": "frontend/src/storage/cashflowRepo.ts",
          "operation": "create",
          "description": "Add a cashflow repository implementing local list/get/addOrUpdate/delete operations with stable IDs and timestamps."
        },
        {
          "path": "frontend/src/storage/mplRepo.ts",
          "operation": "create",
          "description": "Add an M(P/L) repository implementing local match and entry persistence, including match settlement fields (status/winner/settledAt) and required timestamps."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Refactor feature React Query hooks to use local persistence instead of actor calls, keeping queryKeys structure and invalidation behavior, without modifying immutable hook files.",
      "acceptanceCriteria": [
        "All existing pages load their data via React Query without requiring an actor/identity.",
        "Create/update/delete operations update the visible UI immediately (via invalidation/refetch or cache updates) and remain correct after reload.",
        "No changes are made to the immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/lending/api.ts",
          "operation": "modify",
          "description": "Replace useActor-backed queries/mutations with local loans repository operations while keeping existing React Query queryKeys usage and invalidateLoans(queryClient) behavior."
        },
        {
          "path": "frontend/src/features/properties/api.ts",
          "operation": "modify",
          "description": "Replace useActor-backed queries/mutations with local properties repository operations while keeping existing queryKeys and invalidateProperties(queryClient) behavior."
        },
        {
          "path": "frontend/src/features/networth/api.ts",
          "operation": "modify",
          "description": "Replace useActor-backed wealth input list/mutation and net worth aggregate query with local repositories and local aggregate computation while preserving queryKeys.aggregates.* usage."
        },
        {
          "path": "frontend/src/features/cashflow/api.ts",
          "operation": "modify",
          "description": "Replace useActor-backed cashflow list/summary/mutations with local cashflow repository + local summary computation while keeping queryKeys.cashflow.* and invalidateCashflow(queryClient) behavior."
        },
        {
          "path": "frontend/src/features/daily-pl/api.ts",
          "operation": "modify",
          "description": "Replace backend report query with a local computation sourced from locally stored cashflow entries while keeping queryKeys.dailyPL.report()."
        },
        {
          "path": "frontend/src/features/mpl/api.ts",
          "operation": "modify",
          "description": "Replace useActor-backed match/entry/plSummary/settle mutations with local M(P/L) repository operations while keeping existing queryKeys.mpl.* structure and invalidation behavior."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Re-implement all derived/aggregate computations locally while preserving existing UI outputs for net worth, dashboard metrics, lending insights datasets, and monthly cash flow KPI logic.",
      "acceptanceCriteria": [
        "Dashboard overview loads and displays without network connectivity and reflects locally stored loans/properties/wealth inputs.",
        "Lending Insights charts render based on locally stored loans and match the existing calculation behavior (including tenure + monthly/yearly toggle usage already present in the UI).",
        "Net Worth page totals correctly incorporate the latest local wealth inputs plus locally stored property and lending totals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/dashboard/api.ts",
          "operation": "modify",
          "description": "Compute dashboard overview metrics from local repositories (loans/properties/wealth inputs) and keep the existing monthlyCashFlow interest logic and queryKeys.dashboard.overview() usage."
        },
        {
          "path": "frontend/src/storage/aggregates.ts",
          "operation": "create",
          "description": "Add local aggregate helpers for totals used by dashboard and net worth (property total, lending total, wealth input total, net worth total) to match current UI behavior."
        },
        {
          "path": "frontend/src/features/lending/components/LendingInsights.tsx",
          "operation": "modify",
          "description": "Verify Lending Insights uses the locally sourced loans data via React Query and continues to render the same datasets/behaviors without any backend dependency."
        },
        {
          "path": "frontend/src/features/networth/components/NetWorthSummaryCards.tsx",
          "operation": "modify",
          "description": "Ensure Net Worth summary cards remain consistent with the locally computed aggregate outputs and handle offline-first loading states cleanly."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Compute Daily Profit/Loss report strictly from locally stored cashflow entries with the same report semantics as the current UI.",
      "acceptanceCriteria": [
        "Daily Profit/Loss page renders a report while offline and updates correctly when cashflow entries are added/edited/deleted.",
        "Only cashflow-derived data is shown/used for Daily P/L computations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/dailyPl.ts",
          "operation": "create",
          "description": "Implement local Daily P/L report generation that groups cashflow entries daywise and returns totals/net profit-loss in the same shape expected by the UI."
        },
        {
          "path": "frontend/src/features/daily-pl/api.ts",
          "operation": "modify",
          "description": "Update the Daily P/L React Query hook to call the local daily report generator using locally stored cashflow entries (no backend calls), keeping queryKeys.dailyPL.report() intact."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Make M(P/L) match lifecycle, entries, running P/L summary, and settlement fully offline with persistence and settlement freezing behavior preserved.",
      "acceptanceCriteria": [
        "Matches can be created, selected, and persist across reloads offline.",
        "Entries can be added to a match and the running P/L summary updates correctly after each entry (using the existing formula behavior).",
        "After settling a match, the match is frozen (no new entries possible) and the winner/settled timestamp persist across reloads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/storage/mplPlSummary.ts",
          "operation": "create",
          "description": "Add local computation for M(P/L) PLSummary derived from locally stored match + entries, aligned with the existing formula behavior used by the UI."
        },
        {
          "path": "frontend/src/features/mpl/api.ts",
          "operation": "modify",
          "description": "Ensure match creation, entry creation, match detail, entries listing, P/L summary, and settlement use local persistence; enforce settlement freeze semantics by preventing new entry mutations for settled matches and persisting winner/settledAt."
        },
        {
          "path": "frontend/src/features/mpl/components/MatchDetailView.tsx",
          "operation": "modify",
          "description": "Ensure the UI correctly reflects locally persisted match status and continues to disable entry creation when a match is settled (freeze behavior) while offline."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add offline caching for the static frontend bundle so the app loads and routes work offline after one successful online load.",
      "acceptanceCriteria": [
        "After loading the app once online, the user can refresh and navigate core routes while offline and the app still loads.",
        "Offline caching does not break existing routing (TanStack Router) or theming (dark mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Implement a service worker that precaches the app shell assets and uses a navigation fallback to the cached index.html while applying a safe cache strategy for same-origin static assets."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "create",
          "description": "Add a small helper to register the service worker on supported browsers and handle updates without disrupting normal navigation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire service worker registration into app startup (without changing routing structure) so the app becomes offline-loadable after the first successful online load."
        }
      ]
    }
  ]
}