{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 11 frontend rebuild artifacts, service-worker cache busting, and in-app update notice",
  "requirements": [
    {
      "id": "REQ-56",
      "summary": "Ensure Version 11 frontend build artifacts and offline Windows bundle are produced from a clean, consistent build and remain runtime-stable across all existing modules.",
      "acceptanceCriteria": [
        "A clean production build completes successfully without manual intervention.",
        "The deployed app loads all existing modules (Dashboard, Lending, Properties, Net Worth, Cashflow, Daily P/L, M(P/L)) without runtime errors.",
        "The Windows offline ZIP bundle is regenerated from the same Version 11 build output and can be started via the provided Windows scripts."
      ],
      "file_operations": [
        {
          "path": "frontend/offline-bundle/create-windows-offline-zip.mjs",
          "operation": "modify",
          "description": "Tighten bundle validation so the ZIP is always generated from the current build output (dist) and fails fast with clear English messages if the build is missing/empty or missing critical SPA/offline artifacts (e.g., index.html, asset directory). Also ensure the script overwrites/removes any previous ZIP with the same name to avoid stale artifacts being redistributed."
        },
        {
          "path": "frontend/offline-bundle/README.txt",
          "operation": "modify",
          "description": "Update the offline bundle documentation to explicitly identify the bundle as Version 11 and confirm it contains all existing modules listed (Dashboard, Lending, Properties, Net Worth, Cashflow, Daily P/L, M(P/L)) with English text only."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Implement Version 11 service-worker cache busting and caching behavior so new deployments reliably replace stale dashboard assets while preserving offline SPA navigation fallback.",
      "acceptanceCriteria": [
        "The service worker cache name/version is updated so a Version 11 deploy causes old caches to be replaced/invalidated.",
        "After deployment, a user who revisits the app receives the new JS/CSS bundle rather than continuing to render the previous dashboard UI indefinitely.",
        "SPA navigation fallback still works offline (navigating directly to routes like /properties, /daily-profit-loss, /match-pl works when offline after first load)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Update the service worker cache naming/versioning to a Version 11-specific cache (and ensure old caches are deleted on activate). Adjust caching rules to prevent indefinite staleness of the app shell (index.html) while keeping offline support and SPA navigation fallback working for direct route visits after first load."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Enhance service worker registration to detect updates (installed worker waiting) and expose update-available signals to the React app (e.g., via callbacks or a small shared state helper). This enables cache-busting behavior to actually take effect in the client without relying on devtools."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Add an in-app English update notice when a new service worker is waiting, allowing users to refresh to load Version 11 immediately.",
      "acceptanceCriteria": [
        "When a new service worker is installed and waiting, the app shows a clear update message in English (e.g., \"A new version is available. Refresh to update.\").",
        "The user can trigger the update flow (refresh/reload) without needing to open browser devtools or manually clear site data.",
        "If no update is available, no update message is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/useServiceWorkerUpdate.ts",
          "operation": "create",
          "description": "Create a small React hook that subscribes to the service worker update state from the registration helper and exposes: (1) whether an update is available, and (2) an action to activate the waiting worker then reload. Keep all user-facing text in English."
        },
        {
          "path": "frontend/src/components/pwa/ServiceWorkerUpdateNotice.tsx",
          "operation": "create",
          "description": "Create a user-facing update notice UI that appears only when an update is available and provides a clear English call-to-action (e.g., a button to refresh/update now). Prefer using the shadcn-ui component library styling patterns already present in the app (e.g., existing Button usage) to keep UI consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the ServiceWorkerUpdateNotice into the existing layout (e.g., within the sticky header area) so it is visible across all modules/routes when an update is available, and hidden otherwise."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Add the update activation mechanism used by the in-app notice (e.g., message the waiting worker to skip waiting / prompt activation) so clicking the notice action reliably updates and reloads without devtools."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Update offline Windows bundle metadata and user-facing identifiers to clearly reflect Version 11.",
      "acceptanceCriteria": [
        "The offline-bundle configuration metadata includes Version 11 (or equivalent explicit version string).",
        "The generated ZIP name and/or included instructions clearly indicate the build corresponds to Version 11.",
        "Bundle creation script completes successfully and outputs a valid ZIP containing the /app build and Windows launch scripts."
      ],
      "file_operations": [
        {
          "path": "frontend/offline-bundle/bundle.config.json",
          "operation": "modify",
          "description": "Set the offline bundle metadata version to an explicit Version 11 value and update the configured output ZIP name to include Version 11 for clear identification."
        },
        {
          "path": "frontend/offline-bundle/create-windows-offline-zip.mjs",
          "operation": "modify",
          "description": "Ensure the ZIP output filename and console output clearly reflect Version 11 based on bundle.config.json, and (if appropriate) include a small version marker file inside the ZIP so recipients can verify the bundle version after extraction."
        },
        {
          "path": "frontend/offline-bundle/README.txt",
          "operation": "modify",
          "description": "Update the README header/body to clearly state this is Version 11, using English text only, and align any referenced ZIP name/instructions with the updated config."
        },
        {
          "path": "frontend/offline-bundle/WINDOWS_RUN_INSTRUCTIONS.txt",
          "operation": "modify",
          "description": "Update the instructions to clearly identify the bundle as Version 11 and keep any ZIP/app naming references consistent with the updated bundle config, using English text only."
        },
        {
          "path": "frontend/offline-bundle/start-server-win.bat",
          "operation": "modify",
          "description": "Update the launcher banner text (English) to include Version 11 so users can confirm they are running the final release."
        },
        {
          "path": "frontend/offline-bundle/start-server-win.ps1",
          "operation": "modify",
          "description": "Update the launcher banner text (English) to include Version 11 so users can confirm they are running the final release."
        }
      ]
    }
  ]
}